app/views/users/index.html.erb

        <span>Created Events: <%= user.created_events.count %></span>
        <span>Visited Events: <%= user.event_attended.count %></span>
---
SELECT COUNT(*) FROM "events" INNER JOIN "attendances" ON "events"."id" = "attendances"."event_id" WHERE "attendances"."user_id" = ?  [["user_id", 1]]