app/helpers/application_helper.rb

SELECT 1 AS one FROM "attendances" WHERE "attendances"."event_id" = ? AND "attendances"."user_id" = ? LIMIT ?  [["event_id", 3], ["user_id", 1], ["LIMIT", 1]]
---
  def show_registration_button(event)
    if event.attendances.exists?(user_id: current_user.id)