app/controllers/attendances_controller.rb

SELECT 1 AS one FROM "attendances" WHERE "attendances"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "attendances" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["event_id", 3], ["created_at", "2021-10-08 22:23:00.284691"], ["updated_at", "2021-10-08 22:23:00.284691"]]
---
  def join
    unless Attendance.all.exists?(user_id: current_user.id)
      @attendance = Attendance.new(event_id: params[:id], user_id: current_user.id)
      @attendance.save