app/controllers/events_controller.rb

SELECT "events".* FROM "events" ORDER BY created_at DESC
---
  def index
    @events = Event.all.order('created_at DESC')

INSERT INTO "events" ("title", "place", "date", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Greatest party"], ["place", "My home"], ["date", "2021-10-08 22:00:00"], ["created_at", "2021-10-08 22:00:39.505741"], ["updated_at", "2021-10-08 22:00:39.505741"], ["creator_id", 1]]
INSERT INTO "events" ("title", "place", "date", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Pool Party"], ["place", "My home"], ["date", "2021-10-07 22:59:00"], ["created_at", "2021-10-07 23:04:49.307991"], ["updated_at", "2021-10-07 23:04:49.307991"], ["creator_id", 1]]
INSERT INTO "events" ("title", "place", "date", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Festival"], ["place", "KHARKIV Palace"], ["date", "2022-10-11 13:08:00"], ["created_at", "2021-10-11 13:08:31.113686"], ["updated_at", "2021-10-11 13:08:31.113686"], ["creator_id", 2]]
---
  def create
    @event = current_user.created_events.build(event_params)
    @event.save
    if @event.save